In [1]:
import os

In [2]:
os.getcwd()

'C:\\Users\\maitree manna'

In [3]:
path='C:\\Users\\maitree manna\\Desktop\\Text Mining and NLP'

In [4]:
os.chdir(path)

In [5]:
os.getcwd()

'C:\\Users\\maitree manna\\Desktop\\Text Mining and NLP'

In [6]:
import shutil

In [7]:
os.rename

In [11]:
os.rename('C:\\Users\\maitree manna\\Desktop\\Text Mining and NLP\\f1\\Greetings.txt', 'C:\\Users\\maitree manna\\Desktop\\Text Mining and NLP\\f2\\Greetings.txt')

In [12]:
import glob

In [13]:
glob.glob

In [14]:
print(glob.glob('C:\\Users\\maitree manna\\Desktop\\Text Mining and NLP\\f2\\*.txt'))

['C:\\Users\\maitree manna\\Desktop\\Text Mining and NLP\\f2\\Greetings.txt', 'C:\\Users\\maitree manna\\Desktop\\Text Mining and NLP\\f2\\Welcome.txt']

In [16]:
os.rename('C:\\Users\\maitree manna\\Desktop\\Text Mining and NLP\\f2\\Greetings.txt', 'C:\\Users\\maitree manna\\Desktop\\Text Mining and NLP\\f2\\Welcome.txt')

In [17]:
print(glob.glob('C:\\Users\\maitree manna\\Desktop\\Text Mining and NLP\\f2\\*.txt'))

['C:\\Users\\maitree manna\\Desktop\\Text Mining and NLP\\f2\\Welcome.txt']

In [18]:
pwd

'C:\\Users\\maitree manna\\Desktop\\Text Mining and NLP'

In [27]:
!pip install docx

Requirement already satisfied: docx in c:\users\maitree manna\anaconda3\lib\site-packages (0.2.4)
Requirement already satisfied: lxml in c:\users\maitree manna\anaconda3\lib\site-packages (from docx) (4.2.5)
Requirement already satisfied: Pillow>=2.0 in c:\users\maitree manna\anaconda3\lib\site-packages (from docx) (5.2.0)

In [28]:
import docx

In [30]:
doc=docx.Document("NLP.docx")

In [31]:
len(doc.paragraphs)

26

In [33]:
doc.paragraphs[0].text

'To the outside observer, Natural Language Processing (NLP) may seem futuristic.\xa0\xa0a third of smartphone owners use their personal assistants regularly (a hallmark of NLP technologies), even though 95 percent have tried them at some point, according to Creative Strategies, a consultancy. However, Natural Language Processing advances continue in leaps and bounds, as Digital Neural Networks (DNN) and Machine Learning become more intricate. Both technologies enhance NLP technologies up to 30 percent.'

In [36]:
import pandas as pd
import numpy as np

In [37]:
table=pd.read_csv('C:\\Users\\maitree manna\\Desktop\\Text Mining and NLP\\EmployeeDetails.csv')

In [39]:
table

             Name   Age  Salary
0     Arjun singh    24   10000
1       Vibhor Jha   26   25000
2  Yoshita Debnath   23   15000
3   Abhitesh Setia   25   18000
4    Shaurya Nayar   26   30000
5      Disha Gupta   27   23000

In [41]:
new_table = pd.DataFrame(table)

In [42]:
new_table

             Name   Age  Salary
0     Arjun singh    24   10000
1       Vibhor Jha   26   25000
2  Yoshita Debnath   23   15000
3   Abhitesh Setia   25   18000
4    Shaurya Nayar   26   30000
5      Disha Gupta   27   23000

In [45]:
new_table.head(0)

Empty DataFrame
Columns: [Name , Age, Salary]
Index: []